Documents/фин_ПланОценкиЭффективностиИМотивацииОтветственныхБюджетногоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>фин_ПланОценкиЭффективностиИМотивацииОтветственныхБюджетногоПроцесса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.фин_ПрименяемыеПланыОценкиЭффективностиИМотивации</xr:Item>
				<xr:Item>InformationRegister.фин_ПравилаРасчетаЭффективностиРаботыОтветственныхБюджетногоПроцесса</xr:Item>
				<xr:Item>InformationRegister.фин_ПравилаМотивацииОтветственныхБюджетногоПроцесса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьПравилРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УправленческоеПодразделение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ЦелиОтветственныхПоДостижениюПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуемаяВеличина</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ИспользуемыеВеличиныОценкиЭффективностиРаботыОтветственных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничитьПодразделением</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериальноеСтимулирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УправленческоеПодразделение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчетаПремии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_ПланВидовРасчетаПремий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчетаУдержания</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_ПланВидовРасчетаУдержаний</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПремироватьПриПоложительномКоэффициенте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдерживатьПриОтрицательномКоэффициенте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйРазмерДляРасчетаПремии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйРазмерДляРасчетаУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/фин_ПланОценкиЭффективностиИМотивацииОтветственныхБюджетногоПроцесса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Заполнение


////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ЗаменяемыеЗапросы = Новый Массив;
	ЗаменяемыеЗапросы.Добавить("ПереченьПравилРасчета");
	ЗаменяемыеЗапросы.Добавить("МатериальноеСтимулирование");
	
	ДополнительныеПараметрыЗапросов = Новый Структура;
	ДополнительныеПараметрыЗапросов.Вставить("БюджетированиеПоОрганизациям",фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям"));
	
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ,,,,,,ЗаменяемыеЗапросы,ДополнительныеПараметрыЗапросов);
	
	Возврат ПараметрыПроведения;

КонецФункции 

Функция ТекстЗапросаМатериальноеСтимулирование(НомераТаблиц,ПараметрыПроведения, Реквизиты)  Экспорт

	ТекстЗапроса = "";
	
	Если НЕ Реквизиты["ЕстьМатериальноеСтимулирование"] Тогда
		ПараметрыПроведения.Вставить("ТаблицаМатериальноеСтимулирование", Неопределено);
	Иначе
		ТекстЗапроса = 		"ВЫБРАТЬ
		               		|	МатериальноеСтимулирование.Ссылка.Ссылка КАК План,
		               		|	МатериальноеСтимулирование.Ссылка.ПериодДействия КАК Период,
		               		|	МатериальноеСтимулирование.Ссылка,
		               		|	МатериальноеСтимулирование.НомерСтроки,
		               		|	МатериальноеСтимулирование.УправленческоеПодразделение,
		               		|	МатериальноеСтимулирование.Формула,
		               		|	МатериальноеСтимулирование.ВидРасчетаПремии,
		               		|	МатериальноеСтимулирование.ВидРасчетаУдержания,
		               		|	МатериальноеСтимулирование.ПремироватьПриПоложительномКоэффициенте,
		               		|	МатериальноеСтимулирование.УдерживатьПриОтрицательномКоэффициенте,
		               		|	МатериальноеСтимулирование.МинимальныйРазмерДляРасчетаПремии,
		               		|	МатериальноеСтимулирование.НачальныйРазмерДляРасчетаУдержания
		               		|ИЗ
		               		|	Документ.фин_ПланОценкиЭффективностиИМотивацииОтветственныхБюджетногоПроцесса.МатериальноеСтимулирование КАК МатериальноеСтимулирование
		               		|ГДЕ
		               		|	МатериальноеСтимулирование.Ссылка = &Ссылка";

		ТекстЗапроса = ТекстЗапроса + фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
		НомераТаблиц.Вставить("ТаблицаМатериальноеСтимулирование",  НомераТаблиц.Количество());
	КонецЕсли;
	
	Возврат ТекстЗапроса;	
КонецФункции 

Функция ТекстЗапросаПереченьПравилРасчета(НомераТаблиц,ПараметрыПроведения, Реквизиты)  Экспорт

	ТекстЗапроса = "";
	
	Если НЕ Реквизиты["ЕстьПереченьПравилРасчета"] Тогда
		ПараметрыПроведения.Вставить("ТаблицаПереченьПравилРасчета", Неопределено);
	Иначе
		ТекстЗапроса = 		"ВЫБРАТЬ
		               		|	ПереченьПравилРасчета.Ссылка,
		               		|	ПереченьПравилРасчета.НомерСтроки,
		               		|	ПереченьПравилРасчета.ФинансовыйПоказатель,
		               		|	ПереченьПравилРасчета.УправленческоеПодразделение,
		               		|	ПереченьПравилРасчета.Цель,
		               		|	ПереченьПравилРасчета.ДанныеПоказателя,
		               		|	ПереченьПравилРасчета.ИспользуемаяВеличина,
		               		|	ПереченьПравилРасчета.Формула,
		               		|	ПереченьПравилРасчета.УдельныйВес,
		               		|	ПереченьПравилРасчета.ОграничитьПодразделением,
		               		|	ПереченьПравилРасчета.Ссылка.Ссылка КАК План,
		               		|	ПереченьПравилРасчета.Ссылка.ПериодДействия КАК Период
		               		|ИЗ
		               		|	Документ.фин_ПланОценкиЭффективностиИМотивацииОтветственныхБюджетногоПроцесса.ПереченьПравилРасчета КАК ПереченьПравилРасчета
		               		|ГДЕ
		               		|	ПереченьПравилРасчета.Ссылка = &Ссылка";

		ТекстЗапроса = ТекстЗапроса + фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
		НомераТаблиц.Вставить("ТаблицаПереченьПравилРасчета",  НомераТаблиц.Количество());
	КонецЕсли;
	
	Возврат ТекстЗапроса;	
КонецФункции 


////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции


#КонецЕсли
